void bubbleSort(int data[], int n) {
    // กำหนดตัวแปร swapped เพื่อเช็คว่ามีการสลับที่หรือไม่ 
    int swapped = 1; 
    // วนลูปตราบเท่าที่ยังมีการสลับที่เกิดขึ้น (ยังเรียงไม่เสร็จ) 
    while (swapped == 1) {
        // ตั้ง 0 ก่อนเริ่มตรวจสอบในแต่ละรอบ
        swapped = 0;  

        // วนลูปเปรียบเทียบข้อมูลคู่ที่อยู่ติดกัน 
        for (int i = 0; i < n - 1; i++) {
            
            // ถ้าตัวซ้าย มากกว่า ตัวขวา ให้สลับที่กัน
            if (data[i] > data[i + 1]) {
                
                // ขั้นตอนการ Swap (สลับที่) 
                int tmp = data[i];
                data[i] = data[i + 1];
                data[i + 1] = tmp;
                // เมื่อสลับ ให้เปลี่ยนค่าเป็น 1
                swapped = 1; 
            }
        }
    }
}